app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", ""], ["rating", "G"], ["description", ""], ["release_date", "2021-08-21 00:00:00"], ["created_at", "2021-08-21 12:36:27.377182"], ["updated_at", "2021-08-21 12:36:27.377182"]]
---
 def create
      @movie = Movie.create!(movie_params)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "movies" SET "description" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["description", "testtttttt"], ["updated_at", "2021-08-21 12:35:20.092149"], ["id", 20]]
---
 def update
  @movie = Movie.find params[:id]
  @movie.update_attributes!(params[:movie])